title: Enumeration système commande find, tree, mlocate
tags:
    - attack.discovery
    - attack.t1083
logsource:
    category: process_creation
    product: linux
detection:
    selection_find_execution:
        data.exe.path|endswith: '/find'
    selection_tree_execution:
        data.exe.path|endswith: '/tree'
    selection_findmnt_execution:
        data.exe.path|endswith: '/findmnt'
    selection_locate_execution:
        data.exe.path|endswith: '/mlocate'

    selection_find_special_perms:
        data.exe.path|endswith: '/find'
        data.command_line|contains:
            - '-perm -4000'
            - '-perm -2000'
            - '-perm 0777'
            - '-perm -222'
            - '-perm -o w'
            - '-perm -o x'
            - '-perm -u=s'
            - '-perm -g=s'
    condition: 1 of selection_*
falsepositives:
    - Legitimate activities
level: informational
