title: Enumeration système commande find, tree, mlocate
id: d3feb4ee-ff1d-4d3d-bd10-5b28a238cc72
status: test
description: |
    Detects usage of system utilities such as "find", "tree", "findmnt", etc, to discover files, directories and network shares.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1083/T1083.md
author: Daniil Yugoslavskiy, oscd.community, CheraghiMilad
date: 2020-10-19
modified: 2024-12-01
tags:
    - attack.discovery
    - attack.t1083
logsource:
    category: process_creation
    product: linux
detection:
    selection_find_execution:
        data.exe.path|endswith: '/find'
    selection_tree_execution:
        data.exe.path|endswith: '/tree'
    selection_findmnt_execution:
        data.exe.path|endswith: '/findmnt'
    selection_locate_execution:
        data.exe.path|endswith: '/mlocate'

    selection_find_special_perms:
        data.exe.path|endswith: '/find'
        data.command_line|contains:
            - '-perm -4000'
            - '-perm -2000'
            - '-perm 0777'
            - '-perm -222'
            - '-perm -o w'
            - '-perm -o x'
            - '-perm -u=s'
            - '-perm -g=s'
    condition: 1 of selection_*
falsepositives:
    - Legitimate activities
level: informational
