title: Eventlog Cleared
description: One of the Windows Eventlogs has been cleared. e.g. caused by "wevtutil cl" command execution
tags:
    - attack.defense-evasion
    - attack.t1070.001
    - car.2016-04-002
logsource:
    product: windows
    service: system
detection:
    selection:
        EventID: 
            - 104
            - 1102
        Source: 
            - 'WinEventLog:System'
            - 'WinEventLog:Security'
    condition: selection
falsepositives:
    - Rollout of log collection agents (the setup routine often includes a reset of the local Eventlog)
    - System provisioning (system reset before the golden image creation)
level: medium