title: Potential Persistence Attempt Via Run Keys Using Reg.EXE
description: Detects suspicious command line reg.exe tool adding key to RUN key in Registry
tags:
    - attack.privilege-escalation
    - attack.persistence
    - attack.t1547.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\reg.exe'
        CommandLine|contains|all:
            - 'reg'
            - ' add '
        CommandLine|contains:
        - '*\Software\Microsoft\Windows\CurrentVersion\Run*'
        - '*\Software\Microsoft\Windows\CurrentVersion\RunOnce*'
        - '*\Software\Microsoft\Windows\CurrentVersion\RunOnceEx*'
        - '*\Software\Microsoft\Windows\CurrentVersion\RunServicesOnce*'
        - '*\Software\Microsoft\Windows\CurrentVersion\RunServices*'
        - '*\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\Run*'
    condition: selection
falsepositives:
    - Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reasons.
    - Legitimate administrator sets up autorun keys for legitimate reasons.
    - Discord
level: medium
