title: Recursive_search
tags:
    - attack.discovery
    - attack.t1083
logsource:
    category: process_creation
    product: linux
detection:
    selection_recursive_ls:
        data.exe.path|endswith: '/ls'
        data.command_line|contains: '-R'
    condition: selection_*
falsepositives:
    - Legitimate activities
level: informational
