title: Crontab Enumeration
tags:
    - attack.discovery
    - attack.t1007
logsource:
    product: linux
    category: process_creation
detection:
    selection:
        data.exe.path|endswith: '/crontab'
        data.command_line|contains: ' -l'
    condition: selection
falsepositives:
    - Legitimate use of crontab
level: low
