title: System Information Discovery - Auditd
id: f34047d9-20d3-4e8b-8672-0a35cc50dc71
status: test
description: Detects System Information Discovery commands
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f296668303c29d3f4c07e42bdd2b28d8dd6625f9/atomics/T1082/T1082.md
author: Pawel Mazur
date: 2021-09-03
modified: 2023-03-06
tags:
    - attack.discovery
    - attack.t1082
logsource:
    product: linux
    service: auditd
detection:
    selection_1:
        data.command_line|contains:
            - vbox
            - vm
            - xen
            - virtio
            - hv
    selection_2:
        data.exe.path|endswith:
            - '/cat'
            - '/less'
            - '/more'
            - '/head'
            - '/nl'
            - '/tail'
            - '/most'
            - '/grep'
    selection_3:
        data.exe.path|endswith:
            - '/uname'
            - '/lscpu'
            - '/uptime'
            - '/lsmod'
            - '/hostname'
            - '/env'
            - '/kmod'
            - '/lspci'
            - '/dmidecode'
    condition: (1 of selection_1 and selection_2) or selection_3
falsepositives:
    - Likely
level: low
