title: Credentials In Files - Linux
tags:
    - attack.credential-access
    - attack.t1552.001
logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: 'EXECVE'
    keywords_grep:
        data.command_line|contains: 'grep'
    keywords_passwords:
        data.command_line|contains:
            - 'password'
            - 'passd'
            - 'passwd'
    condition: selection and keywords_grep and 1 of keywords_passwords
falsepositives:
    - Unknown
level: high
