title: System Information Discovery - Auditd
tags:
    - attack.discovery
    - attack.t1082
logsource:
    product: linux
    service: auditd
detection:
    selection_1:
        data.command_line|contains:
            - vbox
            - vm
            - xen
            - virtio
            - hv
    selection_2:
        data.exe.path|endswith:
            - '/cat'
            - '/less'
            - '/more'
            - '/head'
            - '/nl'
            - '/tail'
            - '/most'
            - '/grep'
    selection_3:
        data.exe.path|endswith:
            - '/uname'
            - '/lscpu'
            - '/uptime'
            - '/lsmod'
            - '/hostname'
            - '/env'
            - '/kmod'
            - '/lspci'
            - '/dmidecode'
    condition: (1 of selection_1 and selection_2) or selection_3
falsepositives:
    - Likely
level: low
