title: System and Hardware Information Discovery
tags:
    - attack.discovery
    - attack.t1082
logsource:
    product: linux
    service: auditd
detection:
    selection:
        data.exe.path|endswith:
            - '/cat'
            - '/less'
            - '/more'
            - '/head'
            - '/nl'
            - '/tail'
            - '/most'
    selection_paths:
        data.command_line|contains:
            - '/sys/class/dmi/id/bios_version'
            - '/sys/class/dmi/id/product_name'
            - '/sys/class/dmi/id/chassis_vendor'
            - '/proc/scsi/scsi'
            - '/proc/ide/hd0/model'
            - '/proc/version'
            - '/etc/*version'
            - '/etc/*release'
            - '/etc/issue'
    condition: selection and 1 of selection_paths
falsepositives:
    - Legitimate administration activities
level: low
