title: Recursive_search
status: test
description: |
    Detects recursive usage of command find
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1083/T1083.md
date: 2020-10-19
modified: 2024-12-01
tags:
    - attack.discovery
    - attack.t1083
logsource:
    category: process_creation
    product: linux
detection:
    selection_recursive_ls:
        data.exe.path|endswith: '/ls'
        data.command_line|contains: '-R'
    condition: selection_*
falsepositives:
    - Legitimate activities
level: informational
